[
 {
  "titulo": "IA revela fatores que levam a baixo índice de notificação de erros médicos",
  "conteudo": "Os erros médicos são uma das principais causas de morte em ambiente hospitalar. Nos Estados Unidos, as mortes causadas por erro médico superam aquelas causadas por câncer de mama, AIDS e acidentes de carro juntos. O erro médico mais comum é aquele de medicação, sendo os enfermeiros os principais responsáveis por administrar remédios. Enquanto que os erros de medicação que causam prejuízo aos pacientes são geralmente reportados, há um forte incentivo para não reportar os erros “benignos”, sendo as principais razões o medo de atribuição de culpa, de punição e de retaliações. Com isto, as causas dos erros acabam não sendo investigadas adequadamente, e eles continuam acontecendo.\n\n\n\nUm trabalho de pesquisadores da Universidade de Iowa, nos Estados Unidos, aplicou inteligência artificial para entender melhor as principais razões pelas quais estes erros benignos não são reportados. Eles escolheram algoritmos de machine learning por sua habilidade de tratar dados inter-relacionados de maneira não-linear, como é o caso dos comportamentos humanos envolvidos no processo. Primeiro, as variáveis de maior impacto no fenômeno foram selecionadas por um método chamado de extreme learning machines (ELMs), que usa modelos de predição extremamente rápidos para investigar um número grande de variáveis potenciais. As variáveis selecionadas foram então visualizadas na forma de mapas auto-organizáveis (SOMs), que realizam redução não-linear de dimensionalidade para permitir a visualização e interpretação dos resultados.\n\n\n\nOs dados utilizados no estudo envolviam três pesquisas realizadas com enfermeiros, incluindo dados demográficos, relacionados à carga de trabalho, experiência e hierarquia, e como eles avaliam o ambiente e suas inter-relações profissionais. Três cenários foram avaliados: quando o erro é identificado e corrigido antes de afetar o paciente, quando o erro só é identificado depois da administração do medicamento mas o efeito é neutro, e finalmente quando havia risco de prejuízo mas isto não ocorreu. No primeiro caso, as variáveis de maior impacto foram aquelas relacionadas ao tempo de trabalho na unidade de saúde atual e à confiança e dedicação dos colegas. No segundo, teve relevância o turno de trabalho, a habilidade de procurar soluções alternativas para problemas, e o entusiasmo para realizar as tarefas que lhe foram confiadas. No terceiro, foram importantes os anos de experiência do profissional, sua visão otimista sobre o futuro, e sua percepção de um bom trabalho de seus administradores. Os mapas auto-organizáveis correspondentes podem ser visualizados na publicação, que está com acesso aberto.\n\n\n\nEstes resultados podem ajudar os gestores a promover um ambiente organizacional onde os enfermeiros se sintam mais à vontade para reportar os erros de medicação que porventura ocorram, e assim estabelecer políticas para evitar que eles ocorram, melhorando os índices de qualidade de atendimento."
 },
 {
  "titulo": "IA auxilia a produzir melhores diagnósticos de fratura óssea",
  "conteudo": "Um trabalho publicado por pesquisadores da Universidade de Boston, nos Estados Unidos levantou que 24% dos erros de diagnóstico que ocorrem em atendimentos de pronto-socorro se devem a interpretações erradas de raios-X na identificação de fraturas. Algumas causas para isso podem ser atribuídas à urgência com que o diagnóstico é solicitado, e ao fato de que os técnicos trabalham em horários incomuns, o que supostamente atrapalha sua capacidade de interpretação.\n\n\n\nPara ajudar a melhorar este paradigma, os pesquisadores treinaram uma inteligência artificial na tarefa de identificar fraturas em imagens de raios-X. O sistema fez uso de uma biblioteca publicada pelo grupo de pesquisas do Facebook, chamada de Detectron2, que foi desenvolvida para comportar algoritmos de detecção e segmentação de imagens. No trabalho de Boston, foi utilizado um banco de dados contendo pelo menos 60 imagens de cada uma de 8 regiões do corpo, coletadas entre julho de 2020 e janeiro de 2021. Metade das imagens continham fraturas. Este banco de dados foi rotulado por dois radiologistas, sendo as discrepâncias resolvidas por um terceiro. O algoritmo foi treinado para identificar as imagens contendo fraturas e desenhar bounding boxes ao redor delas, para posterior análise de um especialista.\n\n\n\nNa fase de avaliação do sistema, 24 leitores humanos, incluindo radiologistas, ortopedistas, médicos de emergência, assistentes médicos e reumatologistas, avaliaram um banco de dados de validação, com e sem a assistência da inteligência artificial. Nos cenários com o auxílio, o número de fraturas não reportadas diminuiu em 29%, a sensibilidade foi 10% maior, e a especificidade foi 5% melhor. A análise também foi cerca de 6 segundos mais rápida.\n\n\n\nOs pesquisadores concluem que seu sistema apresenta uma melhora nas métricas de qualidade avaliadas, ao mesmo tempo que não impacta negativamente no tempo necessário para a produção do diagnóstico. Estes resultados devem ajudar a diminuir o desgaste de radiologistas e não-radiologistas atendendo emergências, principalmente quando em situações estressantes, ao mesmo tempo que melhora a experiência de atendimento dos pacientes."
 },
 {
  "titulo": "Primeiro programa em Python",
  "conteudo": "Veja nesta aula noções sobre o primeiro programa em Python. A aula faz parte do curso “Lógica de Programação: O Guia Completo”.\n\n\n\nO curso está disponível para assinantes IA Expert Academy.\n\n\n\nCurso na Udemy.\n\n\n\n\n\n"
 },
 {
  "titulo": "IA aumenta a resolução e a sensibilidade de microscópios eletrônicos",
  "conteudo": "O microscópio tradicional funciona utilizando uma série de lentes que exploram propriedades da luz, de forma a tornar visíveis pequenas estruturas. Entretanto, ele possui limitações, de forma que não é possível aumentar as imagens indefinidamente. Para contornar este problema, cientistas criaram os microscópios eletrônicos, que ao invés da luz, exploram propriedades do elétron. Quando um feixe de elétrons atravessa um material de interesse, seus parâmetros físicos são modificados ligeiramente, e esta modificação pode ser capturada por sensores para gerar uma imagem do material original. Com isso, os microscópios eletrônicos alcançam resoluções cerca de 1000 vezes maiores que as versões óticas.\n\n\n\nDe tempos em tempos, avanços na tecnologia tornam disponíveis microscópios eletrônicos ainda mais potentes, mas cientistas que os utilizam como ferramenta de trabalho não costumam fazer atualizações frequentes, pois os equipamentos são muito caros. Isto motivou pesquisadores do Laboratório Nacional de Argonne, nos Estados Unidos, a desenvolver uma atualização de software que fosse capaz de aumentar a capacidade de um microscópio já instalado, sem qualquer custo material. Esta atualização veio na forma de uma inteligência artificial.\n\n\n\nO trabalho envolveu o conhecimento prévio de que, junto com as informações dos parâmetros dos elétrons que já são capturadas atualmente, existem outras propriedades que são perdidas durante a operação tradicional dos equipamentos. Uma delas é a chamada fase, que carrega dados sobre o potencial eletrostático e de magnetização dos materiais analisados. Os pesquisadores desenvolveram um método de machine learning para reconstruir esta informação a partir dos demais dados disponíveis, e assim produzir ainda mais dados sobre o material de interesse.\n\n\n\nAlém de ser do interesse de engenheiros pesquisando materiais para baterias e dispositivos eletrônicos, os dados de fase podem ser usados em conjunto com as demais propriedades capturadas pelos microscópios para aumentar ainda mais a resolução e a sensibilidade dos equipamentos, expandindo seu potencial de investigação sem investimento adicional.\n\n\n\nA recuperação dos dados de fase já é um problema antigo da área de microscopia, e esta é a primeira solução que não depende do conhecimento prévio dos parâmetros do equipamento, o que só foi possível graças ao envolvimento da inteligência artificial no trabalho."
 },
 {
  "titulo": "Estruturas condicionais em Python",
  "conteudo": "Veja nesta aula noções sobre estruturas condicionais em Python. A aula faz parte do curso “Lógica de Programação: O Guia Completo”.\n\n\n\nO curso está disponível para assinantes IA Expert Academy.\n\n\n\nCurso na Udemy.\n\n\n\n\n\n"
 },
 {
  "titulo": "IA possibilita primeiro diagnóstico precoce para a sepse",
  "conteudo": "A sepse é uma doença causa pela resposta disfuncional do organismo a uma infecção, levando a uma inflamação generalizada que pode causar a morte. No ano passado, o aumento da mortalidade causado pela COVID-19 fez com que a sepse fosse responsável por uma de cada cinco fatalidades mundialmente. A doença é caracterizada por uma série de sintomas genéricos como febre, fatiga, hiperventilação e batimento cardíaco acelerado, que são facilmente confundidos com outras condições. Por isso, o diagnóstico só é confirmado após 24 ou até 48 horas, quando o quadro se torna evidente e o uso de antibióticos mais potentes começa a ser justificado. Entretanto, cada hora a mais sem tratamento representa um aumento de cerca de 7,5% no risco de morte, o que torna urgente um método de diagnóstico precoce.\n\n\n\nPara solucionar este problema, pesquisadores da Universidade da Columbia Britânica, no Canadá, se valeram de um método moderno de detecção de atividade celular, junto com um sistema de inteligência artificial, para diagnosticar a sepse tão logo um paciente seja admitido em um hospital. Em um estudo publicado em janeiro, eles descrevem que o perfil metabólico dos pacientes foi determinado através da quantificação de RNA em seu sangue; o RNA é uma molécula intermediária entre o DNA e seu produto final, as enzimas, as quais são fundamentalmente responsáveis por toda atividade biológica. Por isso, o RNA costuma ser usado como indicador de quais funções celulares estão sendo solicitadas pelo organismo em dado momento. Como a quantidade de informação obtida é grande, algoritmos de machine learning foram aplicados para tentar identificar o quadro de sepse e, inclusive, categorizar seus subtipos.\n\n\n\nO treinamento do modelo utilizou dados coletados de 348 pacientes originários de quatro continentes, o que incluiu o maior estudo clínico genômico de pacientes atendidos em emergência. O modelo se mostrou capaz de identificar os biomarcadores que representam o primeiro sinal de cinco tipos diferentes de sepse, utilizando as amostras coletadas dos pacientes assim que eles chegam ao pronto-socorro, com 97% de acurácia. Os resultados foram validados com dados de outros 1062 pacientes participantes de outros dois estudos.\n\n\n\nOs pesquisadores consideram importante a alta acurácia na identificação de cinco diferentes subtipos da doença, já que algumas têm risco muito maior. Os mesmos biomarcadores foram aprovados também em um cenário de UTI, onde um dos subtipos de sepse apresenta taxa de mortalidade de 46%.\n\n\n\nA técnica de medir a expressão dos genes já está disponível em muitos hospitais, podendo entregar resultados em duas horas após a coleta das amostras. A inteligência artificial desenvolvida neste estudo vai permitir o diagnóstico precoce da sepse e assim ajudar os médicos a escolher pelo tratamento adequado."
 },
 {
  "titulo": "IA auxilia procuradores na montagem de processos de acusação",
  "conteudo": "Uma das áreas mais polêmicas para a aplicação de inteligência artificial é a do direito.  Mesmo assim, pesquisadores vêm buscado treinar algoritmos para ajudar nos procedimentos legais relacionados a crimes. É o caso de um sistema desenvolvido pela Procuradoria Popular de Shanghai Pudong, na China, o escritório de procuradoria com maior carga de trabalho no país. O trabalho dos procuradores é identificar e classificar infrações que se transformam em acusação, necessário para a abertura de um processo. O novo sistema foi desenvolvido justamente para fazer esta parte do trabalho, dando maior celeridade ao processo.\n\n\n\nO algoritmo foi treinado com base em mais de 17 mil casos reportados entre 2015 e 2020. Ele usa ferramentas de processamento de linguagem natural para identificar as partes relevantes da descrição dos casos, a partir das quais ele constrói um perfil com 1000 atributos abstratos que são utilizados para a classificação da ofensa. Até agora, os oito crimes mais comuns na área são contemplados, entre eles fraude de cartão de crédito, operação de jogos de azar, direção perigosa, danos físicos intencionais, obstrução de oficiais da justiça e roubo. O sistema tem uma acurácia de 97%.\n\n\n\nA intenção do desenvolvimento é reduzir a carga de trabalho dos procuradores para esta tarefa repetitiva e monótona, permitindo que eles possam realizar trabalhos mais complexos no lugar. Os pesquisadores garantem que o sistema não será empregado em sua atual versão no processo de decisão da culpa e eventual sentença, apenas na montagem do processo.\n\n\n\nMesmo com críticas relevantes, a inteligência artificial tem sido cada vez mais utilizada no ambiente legal. A China mesmo utiliza o chamado Sistema 206 desde 2016, que é responsável por avaliar a qualidade de evidências, as condições para uma prisão e a periculosidade de um suspeito. Na Alemanha, procuradores têm aplicado reconhecimento de imagem e técnicas forenses digitais para aumentar a velocidade e a precisão dos processos.\n\n\n\nÉ importante manter a discussão aberta para garantir que os algoritmos atinjam o maior padrão de justiça possível, mas é inegável que eles oferecem a oportunidade de acelerar os processos que, ao cargo exclusivamente das pessoas, são lentos por natureza."
 },
 {
  "titulo": "Previsão de Vendas com Facebook Prophet",
  "conteudo": "Veja nesta aula noções sobre previsão de vendas com Facebook Prophet. A aula faz parte do curso “Ciência de Dados para Empresas e Negócios”.\n\n\n\nO curso está disponível para assinantes IA Expert Academy.\n\n\n\nCurso na Udemy.\n\n\n\n\n\n"
 },
 {
  "titulo": "IA cria versão vegana de carne de frango",
  "conteudo": "O mercado vegetariano e vegano anda em pleno crescimento. Uma das tendências neste nicho são produtos que simulam suas versões de carne, mantendo a consistência e o sabor de hambúrgueres e petiscos, por exemplo. A empresa chilena The Not Company está investindo nesta área, e acaba de lançar uma nova versão de frango vegano cujo desenvolvimento se deve à inteligência artificial.\n\n\n\nReproduzir os atributos da carne não é fácil, e em muitos casos isto tem sido alcançado na base de tentativa e erro. Mas a empresa desenvolveu uma inteligência artificial capaz de auxiliar na combinação de ingredientes vegetais para criar produtos com um objetivo definido. Batizado de Giuseppe, o sistema usa um catálogo extenso de ingredientes para propor novos produtos. Foi assim que surgiu a nova linha que imita a carne de frango, apresentando versões de nugget, hambúrguer e filé da ave, sob o nome auto-explicativo de NotChicken.\n\n\n\nA base da nova linha é a ervilha, que já vem sendo utilizada por outras empresas da área, mas graças ao uso da inteligência artificial, a empresa se permitiu ser mais ousada, testando combinações que incluem, por exemplo, bambu, pêssego e grão-de-bico. Desta forma, os novos produtos representam uma evolução frente às outras opções disponíveis.\n\n\n\nA empresa também utiliza outros ingredientes inesperados, como abacaxi, coco, repolho e beterraba, para produzir versões veganas de leite, sorvete e maionese, por exemplo. A linha NotChicken está programada para ser lançada inicialmente no Chile, na Argentina e no Brasil, depois se expandindo para os mercados americano e canadense, com alta demanda por esses produtos."
 },
 {
  "titulo": "Processamento de Linguagem Natural – Trilha de Aprendizagem",
  "conteudo": "Saiba mais sobre a Trilha de Aprendizagem Processamento de Linguagem Natural.  \n\n\n\nEsta trilha visa fornecer ao aluno os subsídios necessários para desenvolver aplicações reais e trabalhar na área de Processamento de Linguagem Natural. Ao final, o aluno será capaz de desenvolver seus próprios projetos utilizando textos em vários idiomas.\n\n\n\nTodos os cursos da trilha estão disponíveis para assinantes IA Expert Academy.\n\n\n\n\n\n"
 }
]